export default {
  number: /^[0-9]+$/, // 数字
  numberHundred: /^100$|^(\d|[1-9]\d)(\.\d{0,2})?$/, // 小于100的数
  realNumber: /^-?([1-9]\d*|0)(\.\d+)?$/, // 整数和小数，实数
  positiveRealNumber: /^([1-9]\d*|0)(\.\d+)?$/, // 正实数
  integer: /^-?([1-9]\d*|0)$/, // 整数
  decimal: /^-?([1-9]\d*\.\d+|0\.\d+)$/, // 小数
  positiveInteger: /^[1-9]\d*$/, // 正整数
  nonPositiveInteger: /^[1-9]\d*|0$/, // 非负整数，自然数
  negativeInteger: /^-[1-9]\d*$/, // 负整数
  nonNegativeInteger: /^-[1-9]\d*|0$/, // 非正整数
  idcard: /^\d{15}(\d{2}[A-Za-z0-9])?$/,
  email: /^([a-zA-Z0-9._-])+@([a-zA-Z0-9_-])+(.[a-zA-Z0-9_-])+/,
  // eslint-disable-next-line no-useless-escape
  url: /^(https?:\/\/)?([\da-z.-]+).([a-z.]{2,6})([\/\w .-])\/?$/,
  ip: /^(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?).){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)$/,
  chinese: /^[\u4e00-\u9fa5]$/, // 汉字
  telphone: /^(\(\d{3,4}\)|\d{3,4}-|\s)?\d{7,14}$/, // 固定电话
  mobile: /^1[3-9](\d{9})$/, // 手机号码
  money: /(^[1-9]([0-9]+)?(\.[0-9]{1,2})?$)|(^[0-9]\.[0-9]([0-9])?$)|(^0$)/, // 输入金额
  longMoney: /(^[1-9]([0-9]+)?(\.[0-9]{1,4})?$)|(^[0-9]\.[0-9]([0-9]{0,3})$)|(^0$)/, // 四位小数金额
  volume: /(^[1-9]([0-9]+)?(\.[0-9]{1,3})?$)|(^[0-9]\.[0-9]([0-9])?$)|(^0$)/ // 输入流量
}
